In [ ]:
SQL Task

# 1. Introduction to SQL

SQL (Structured Query Language) is used to manage and manipulate databases.

Main Categories:
- DDL (Data Definition Language)
- DML (Data Manipulation Language)
- DQL (Data Query Language)

# 2. Creating a Table in SQL

We use CREATE TABLE to define a table structure.

In [1]:
import sqlite3

# Create connection
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

# Create table
cursor.execute("""
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    marks INTEGER
)
""")

conn.commit()
print("Table created successfully!")

Table created successfully!

# 3. Inserting Data into Table

We use INSERT INTO to add records.

In [2]:
cursor.execute("INSERT INTO students (name, age, marks) VALUES ('Yashas', 20, 85)")
cursor.execute("INSERT INTO students (name, age, marks) VALUES ('Rahul', 21, 90)")
cursor.execute("INSERT INTO students (name, age, marks) VALUES ('Anita', 19, 88)")

conn.commit()

print("Data inserted successfully!")

Data inserted successfully!

# 4. Selecting Data

We use SELECT to retrieve data from a table.

In [3]:
cursor.execute("SELECT * FROM students")

rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Yashas', 20, 85)
(2, 'Rahul', 21, 90)
(3, 'Anita', 19, 88)

# 5. WHERE Clause

Used to filter records based on conditions.

In [4]:
cursor.execute("SELECT * FROM students WHERE marks > 85")

rows = cursor.fetchall()

for row in rows:
    print(row)

(2, 'Rahul', 21, 90)
(3, 'Anita', 19, 88)

# 6. UPDATE Statement

Used to modify existing records.

In [5]:
cursor.execute("UPDATE students SET marks = 95 WHERE name = 'Yashas'")
conn.commit()

print("Record updated!")

Record updated!

# 7. DELETE Statement

Used to remove records from a table.

In [6]:
cursor.execute("DELETE FROM students WHERE name = 'Rahul'")
conn.commit()

print("Record deleted!")

Record deleted!

# 8. Aggregate Functions

Common Functions:
- COUNT()
- SUM()
- AVG()
- MAX()
- MIN()

In [7]:
cursor.execute("SELECT AVG(marks) FROM students")

average = cursor.fetchone()

print("Average Marks:", average[0])

Average Marks: 91.5

# 9. ORDER BY Clause

Used to sort results.

In [8]:
cursor.execute("SELECT * FROM students ORDER BY marks DESC")

rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Yashas', 20, 95)
(3, 'Anita', 19, 88)

In [9]:
conn.close()
print("Database connection closed.")

Database connection closed.

# 11. GROUP BY Clause

GROUP BY is used to group rows that have the same values.

It is mostly used with aggregate functions like:
- COUNT()
- SUM()
- AVG()

In [11]:
import sqlite3

# Create connection
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

# Group by age and calculate average marks
cursor.execute("""
SELECT age, AVG(marks)
FROM students
GROUP BY age
""")

rows = cursor.fetchall()

for row in rows:
    print("Age:", row[0], "Average Marks:", row[1])

conn.close()

Age: 19 Average Marks: 88.0
Age: 20 Average Marks: 95.0

# 12. HAVING Clause

HAVING is used to filter grouped results.
It works with GROUP BY.

In [13]:
import sqlite3

# Create connection
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

cursor.execute("""
SELECT age, AVG(marks)
FROM students
GROUP BY age
HAVING AVG(marks) > 85
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

conn.close()

(19, 88.0)
(20, 95.0)

# 13. Creating Another Table

We create a courses table to understand JOINS.

In [16]:
import sqlite3

# Create connection (re-establish for this cell)
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

cursor.execute("""
CREATE TABLE IF NOT EXISTS courses (
    student_id INTEGER,
    course_name TEXT
)
""")

cursor.execute("INSERT INTO courses VALUES (1, 'Python')")
cursor.execute("INSERT INTO courses VALUES (2, 'SQL')")
cursor.execute("INSERT INTO courses VALUES (3, 'Data Science')")

conn.commit()

print("Courses table created and data inserted!")

# Close connection after operations are done in this cell
conn.close()

Courses table created and data inserted!

# 14. INNER JOIN

INNER JOIN combines rows from two tables
based on a related column.

In [18]:
import sqlite3

# Re-establish connection for this cell
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

cursor.execute("""
SELECT students.name, courses.course_name
FROM students
INNER JOIN courses
ON students.id = courses.student_id
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

conn.close()

('Yashas', 'Python')
('Anita', 'Data Science')

# 15. LEFT JOIN

LEFT JOIN returns all records from the left table
and matched records from the right table.

In [22]:
import sqlite3

# Re-establish connection for this cell
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

cursor.execute("""
SELECT students.name, courses.course_name
FROM students
LEFT JOIN courses
ON students.id = courses.student_id
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

conn.close()

('Yashas', 'Python')
('Anita', 'Data Science')

# 16. Subquery

A subquery is a query inside another query.

In [24]:
import sqlite3

# Re-establish connection for this cell
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

cursor.execute("""
SELECT name, marks
FROM students
WHERE marks > (SELECT AVG(marks) FROM students)
""")

rows = cursor.fetchall()

for row in rows:
    print(row)

conn.close()

('Yashas', 95)

# 17. SQL Constraints

Common Constraints:
- PRIMARY KEY
- NOT NULL
- UNIQUE
- CHECK

In [26]:
import sqlite3

# Re-establish connection for this cell
conn = sqlite3.connect("student.db")
cursor = conn.cursor()

cursor.execute("""
CREATE TABLE IF NOT EXISTS employees (
    emp_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    salary INTEGER CHECK(salary > 0)
)
""")

conn.commit()

print("Table with constraints created!")

conn.close()

Table with constraints created!